test/request-response-samples/multiCall__rpc_stype_request_xsi_attributes/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:typens="urn:Magento"><SOAP-ENV:Body><typens:multiCall><sessionId>sessionId</sessionId><calls><item xsi:type="ns1:Array" xmlns:ns1="http://schemas.xmlsoap.org/soap/encoding/"><ns1:item>product_stock.update</ns1:item><ns1:item xsi:type="ns2:Array" xmlns:ns2="http://schemas.xmlsoap.org/soap/encoding/"><ns1:item>HTC Touch Diamond</ns1:item><ns1:item xsi:type="ns3:Map" xmlns:ns3="http://xml.apache.org/xml-soap"><ns1:item><ns1:key>qty</ns1:key><ns1:value>9199</ns1:value></ns1:item><ns1:item><ns1:key>is_in_stock</ns1:key><ns1:value>1</ns1:value></ns1:item></ns1:item></ns1:item></item></calls></typens:multiCall></SOAP-ENV:Body></SOAP-ENV:Envelope>